Tekla Open API Reference for Tekla Structures 2025
LibraryProfileItem Constructor
 Creates a new library profile item instance.
 Namespace: Tekla.Structures.Catalogs
 Assembly: Tekla.Structures.Catalogs (in Tekla.Structures.Catalogs.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public LibraryProfileItem()
Public Sub New
See Also
Reference
LibraryProfileItem Class
Tekla.Structures.Catalogs Namespace